chauphuocvu/LCD-water-control-28-11/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/GUIlib/src/uiappuser.c
/*******************************************************************************
* @file		: uiappuser.c
* @author	: IMS Systems LAB & Technical Marketing
* @version	: V1.0.0
* @date		: 26-Apr-2017
* @brief	: Event Handlers
*******************************************************************************/
/* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
* TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
* DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
* FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
* CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* <h2><center>&copy; COPYRIGHT 2017 STMicroelectronics</center></h2>
*******************************************************************************
*/ 
/*includes----------------------------------------------------------------------*/
#include "uiframework.h"
#include "uiappuser.h"
#include "LcdHal.h"
#include "stm32f4xx_uartstdio.h"
#include "flash_memory_driver.h"
#include "Sensor.h"
/*Chau Phuoc Vu 21/5/2019*/
uint8_t 		status_for_warning = BACK;
//
uint8_t 		DosingTest_Flag = START_START;
uint8_t 		Languages_Choose;
uint8_t 		PoolSelect;
uint8_t 		Temperature;
uint8_t 		WaterHardnessSelect;
uint8_t 		TypeofProbe;
uint8_t   	RequireValueDosepH_DoseHour;
uint8_t 		RequireValueDosepH_DoseDay;
uint16_t 		PoolVolume;
uint16_t 		FiltrationPeriod;
uint16_t 		CalibrationAir;
uint16_t 		CalibrationWater;
uint16_t 		RequireValueRedoxpH_Redox;
float 	 		Probe_pH;
float				Probe_pH_temp;
float 	 		Probe_CLF;
float 	 		RequireValuepH;
float 	 		RequireValueCLF;
int8_t   	RequireValueDosepH_DoseHour_Display;
int8_t 		RequireValueDosepH_DoseDay_Display;
uint16_t 		PoolVolume_Display;
uint16_t 		FiltrationPeriod_Display;
float 		CalibrationAir_Display;
float 		CalibrationWater_Display;
uint16_t 		RequireValueRedoxpH_Redox_Display;
float 	 		Probe_pH_Display;
float 		 	Probe_CLF_Display;
float 		 	RequireValuepH_Display;
float 		 	RequireValueCLF_Display;
/*chau phuoc vu 25/4/2019*/
uint8_t Calibration_pH_Flag = NO_CALIBRATION_PH;
uint8_t Calibration_Rx_Flag = NO_CALIBRATION_RX; 
/*chau phuoc vu 17/5/2019*/
float Probe_pH_less_5 = 0;
float Probe_pH_more_5 = 0;
float pH_V_calibration_less_5_buffer = 0;
float pH_V_calibration_more_5_buffer = 0;
float Temp_calibration_less_5_buffer = 0;
float Temp_calibration_more_5_buffer = 0;

/*Start Screen */
void StartScreen_Setting(void)
{
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
/*Settings Screen */
void SettingsScreen_Language(void)
{
	DestroyPage(CurrentScreen);
	Show_LanguagesScreen();
}
////////////////////////////////////////////////////////////
void SettingsScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void SettingsScreen_Parameters(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void SettingsScreen_Calibration(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
//////////////////////////////////////////////////////////////
void SettingsScreen_DosingTest(void)
{
			DestroyPage(CurrentScreen);
	if (DosingTest_Flag != START_START)
		Create_DosingTestScreen();
	else;
	Show_DosingTestScreen();		
}
//////////////////////////////////////////////////////////////
void SettingsScreen_TypeOfProbe(void)
{
	DestroyPage(CurrentScreen);
	Show_TypeOfProbeScreen();
}
/////////////////////////////////////////////////////////////
void SettingsScreen_SaveData(void)
{
	SaveDataToFlash();
}





/*DosingTest Screen */
void DosingTestScreen_Back(void)
{
	DosingTest_Flag = START_START;
	step_Clo = step_pH = 0; 
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
//////////////////////////////////////////////////////////////
void DosingTestScreen_BackToStart(void)
{
	DosingTest_Flag = START_START;
	step_Clo = step_pH = 0; 
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void DosingTestScreen_StartDisinf(void)
{
		switch (DosingTest_Flag)
	{
		case START_START:
			DosingTest_Flag = STOP_START;
		break;
		case START_STOP:
			DosingTest_Flag = STOP_STOP;	
		break;
		case STOP_START:
			DestroyPage(CurrentScreen);
			DosingTest_Flag = START_START;	
		break;
		case STOP_STOP :
			DosingTest_Flag = START_STOP;	
		break;
		default:
		break;
	}	
	Show_DosingTestScreen();

}
//////////////////////////////////////////////////////////////
void DosingTestScreen_StartPh(void)
{	
		switch (DosingTest_Flag)
	{
		case START_START:
			DosingTest_Flag = START_STOP;
		break;
		case START_STOP:
			DestroyPage(CurrentScreen);
			DosingTest_Flag = START_START;	
		break;
		case STOP_START:
			DosingTest_Flag = STOP_STOP;	
		break;
		case STOP_STOP :
			DosingTest_Flag = STOP_START;	
		break;
		default:
		break;
	}	
	Show_DosingTestScreen();
}








/*Parameters Screen */
void ParametersScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
////////////////////////////////////////////////////////////
void ParametersScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersScreen_Pool(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersPoolVolumeScreen();
}
//////////////////////////////////////////////////////////////
void ParametersScreen_Water(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}
////////////////////////////////////////////////////////////
void ParametersScreen_pH(void)
{
	DestroyPage(CurrentScreen);
// Chon man hinh de hien thi dc set tu Type of Probe
	switch(TypeofProbe)
	{
		case FREECHLORINE:
			Show_ParametersRequireValuepHScreen();
			break;
		case REDOXPROBE:
			Show_ParametersRequireValueRedoxpH_RodexScreen();
			break;
		case MLPERHOUR:
			Show_ParametersRequireValueDosepH_DoseHourScreen();
			break;
		case MLPERDAY:
			Show_ParametersRequireValueDosepH_DoseDayScreen();
			break;
		default:
			break;
	}	
}




/*ParametersPoolVolumePool Screen */
void ParametersPoolVolumeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_inc(void)
{
		PoolVolume_Display +=1;
	if (PoolVolume_Display > 50)
		PoolVolume_Display = 50;
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_dec(void)
{
		PoolVolume_Display -=1;
	if (PoolVolume_Display == 0)
		PoolVolume_Display = 0;
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_OK(void)
{
	PoolVolume = PoolVolume_Display;
}
//////////////////////////////////////////////////////////////
void ParametersPoolVolumeScreen_FiltrationPeriod(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersFitrationPeriodScreen();
}



/*ParametersFitrationPeriod Screen */
void ParametersFitrationPeriodScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
///////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_inc(void)
{
		FiltrationPeriod_Display +=1;
	if (FiltrationPeriod_Display > 24)
		FiltrationPeriod_Display = 24;
}
	///////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_dec(void)
{	
	FiltrationPeriod_Display -=1;
	if (FiltrationPeriod_Display == 6)
		FiltrationPeriod_Display = 6;		
}
	//////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_OK(void)
{
	FiltrationPeriod = FiltrationPeriod_Display;
}
	//////////////////////////////////////////////////////////////
void ParametersFitrationPeriodScreen_PoolVolume(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersPoolVolumeScreen();
}




/*ParametersWaterScreen */
void ParametersWaterScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
///////////////////////////////////////////////////////////////
void ParametersWaterScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Indoor(void)
{
	PoolSelect = INDOOR;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Outdoor(void)
{
	PoolSelect = OUTDOOR;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_ExtremeCondition(void)
{
	PoolSelect = EXTREME_CONDITION;
	DestroyPage(CurrentScreen);
	Show_WarningExtremeConditionScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Less20oC(void)
{
	Temperature = LESS20oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_20oC_30oC(void)
{
	Temperature = MIDDLE_20oC_30oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_More30oC(void)
{
	Temperature = MORE30oC;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Soft(void)
{
	WaterHardnessSelect = SOFT;
	DestroyPage(CurrentScreen);
	Show_WarningWaterHardnessScreen();
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_Hard(void)
{
	WaterHardnessSelect = HARD;
}
//////////////////////////////////////////////////////////////////
void ParametersWaterScreen_VeryHard(void)
{
	WaterHardnessSelect = VERY_HARD;
}



/* WarningMaximalSafetyScreen */
void WarningMaximalSafetyScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


