chauphuocvu/LCD-water-control-28-11/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/GUIlib/src/uiappuser.c
void WarningExtremeConditionScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


void WarningWaterHardnessScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}


void WarningProbeCalibration30_78Screen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
}


void WarningProbeCalibrationScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
}

void WarningProbeCalibration70Screen_OK(void)
{
	DestroyPage(CurrentScreen);
	/*Chau phuoc vu 14/5/2019*/
	Calibration_pH_Flag = CALIBRATION_PH;
	Probe_pH_Display = 4.0;
	/*Chau phuoc vu 20/5/2019*/
	Probe_pH_less_5 = 0;
	Probe_pH_more_5 = 0;
  pH_V_calibration_less_5_buffer = 0;
  pH_V_calibration_more_5_buffer = 0;
  Temp_calibration_less_5_buffer = 0;
  Temp_calibration_more_5_buffer = 0;
	Show_CalibrationpHProbeScreen();
}

void WarningProbeCalibrationRequiredValueScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
}

void WarningProbeCalibrationRequiredValueRedScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
}


void WarningProbeCalibrationRequiredValueImpossibleScreen_OK(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}

void WarningTooRapidChangeScreen_CancelRestictions(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersWaterScreen();
}




/*ParametersRequireValuepH Screen */
void ParametersRequireValuepHScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_inc(void)
{
		RequireValuepH_Display +=(float)0.1;
	if(RequireValuepH_Display > (float)7.6)
		RequireValuepH_Display = 7.6;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_dec(void)
{
		RequireValuepH_Display -=(float)0.1;
	if(RequireValuepH_Display < (float)6.5)
		RequireValuepH_Display = 6.5;	
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_OK(void)
{
	RequireValuepH = RequireValuepH_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValuepHScreen_CLF(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueCLFScreen();
}




/*ParametersRequireValueCLF Screen */
void ParametersRequireValueCLFScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_inc(void)
{
		RequireValueCLF_Display +=(float)0.1;
	if(RequireValueCLF_Display > (float)1.2)
		RequireValueCLF_Display = 1.2;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_dec(void)
{	
		RequireValueCLF_Display -=(float)0.1;
	if(RequireValueCLF_Display < (float)0.5)
		RequireValueCLF_Display = 0.5;
		
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_OK(void)
{
	RequireValueCLF = RequireValueCLF_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueCLFScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValuepHScreen();
}

/*Calibration Screen */
void CalibrationScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
void CalibrationScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void CalibrationScreen_CLFProbe(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationCLFProbeScreen();
	DestroyPage(CurrentScreen);
	Show_WarningProbeCalibrationRequiredValueScreen();
}
void CalibrationScreen_pHProbe(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationpHProbeScreen();
	DestroyPage(CurrentScreen);
	Show_WarningProbeCalibration70Screen();	
}
void CalibrationScreen_WaterThermometer(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationWaterScreen();
}
void CalibrationScreen_AirThermometer(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationAirScreen();
}


/*CalibrationpHProbe Screen */
void CalibrationpHProbeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	/*chau phuoc vu 25/1/2019*/
	Calibration_pH_Flag = NO_CALIBRATION_PH;
	/*chau phuoc vu 21/5/2019*/
	if ((pH_V_calibration_less_5_buffer == 0)||(pH_V_calibration_more_5_buffer == 0))
	{
		Show_WarningProbepHCalibrationScreen();
		status_for_warning = BACK;
	}
	else 
	{
		Probe_pH = Probe_pH_more_5;
		pH_V_calibration = pH_V_calibration_more_5_buffer;
		slope_calibration = (pH_V_calibration_more_5_buffer - pH_V_calibration_less_5_buffer)/(Probe_pH_more_5 - Probe_pH_less_5);
		Probe_pH_temp = Temp_calibration_more_5_buffer;
		Show_CalibrationScreen();
	}
}
void CalibrationpHProbeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	/*chau phuoc vu 25/1/2019*/
	Calibration_pH_Flag = NO_CALIBRATION_PH;
	/*chau phuoc vu 21/5/2019*/
	if ((pH_V_calibration_less_5_buffer == 0)||(pH_V_calibration_more_5_buffer == 0))
	{
		Show_WarningProbepHCalibrationScreen();
		status_for_warning = BACKTOSTART;
	}
	else 
	{
		Probe_pH = Probe_pH_more_5;
		pH_V_calibration = pH_V_calibration_more_5_buffer;
		slope_calibration = (pH_V_calibration_more_5_buffer - pH_V_calibration_less_5_buffer)/(Probe_pH_more_5 - Probe_pH_less_5);
		Probe_pH_temp = Temp_calibration_more_5_buffer;
		Show_StartScreen();
	}
}
void CalibrationpHProbeScreen_inc(void)
{
	/*chau phuoc vu 25/1/2019*/
	Calibration_pH_Flag = CALIBRATION_PH;
	
	Probe_pH_Display +=(float)0.1;
	if(Probe_pH_Display > (float)7.8)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibration30_78Screen();
		Probe_pH_Display = 7.8;
	}
}
void CalibrationpHProbeScreen_dec(void)
{
	/*chau phuoc vu 25/1/2019*/
	Calibration_pH_Flag = CALIBRATION_PH;
	
	Probe_pH_Display -=(float)0.1;
	if(Probe_pH_Display < (float)3.0)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibration30_78Screen();
		Probe_pH_Display = 3.0;
	}
}
void CalibrationpHProbeScreen_OK(void)
{
//	Probe_pH = Probe_pH_Display;
///*Chau Phuoc Vu 23/4/2019*/
//	pH_V_calibration = pH_V_read;
	/*Chau phuoc vu 16/5/2019*/
	if (Probe_pH_Display < (float)5.0)
	{
		Probe_pH_less_5 = Probe_pH_Display;
		pH_V_calibration_less_5_buffer = pH_V_read;
		Temp_calibration_less_5_buffer = temp;
	}
	else 
	{
		Probe_pH_more_5 = Probe_pH_Display;
		pH_V_calibration_more_5_buffer = pH_V_read;
		Temp_calibration_more_5_buffer = temp;
	}
}




/*CalibrationCLFProbe Screen */
void CalibrationCLFProbeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
void CalibrationCLFProbeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void CalibrationCLFProbeScreen_inc(void)
{
	Probe_CLF_Display +=(float)0.1;
	if (Probe_CLF_Display > (float)1.2)
		Probe_CLF_Display = 1.2;
}
void CalibrationCLFProbeScreen_dec(void)
{
		Probe_CLF_Display -=(float)0.1;
	if(Probe_CLF_Display == RequireValueCLF)
	{
		DestroyPage(CurrentScreen);
		Show_WarningProbeCalibrationrequiredValueRedScreen();
	}
	else if (Probe_CLF_Display < (float)0.5)
		Probe_CLF_Display = 0.5;
}
void CalibrationCLFProbeScreen_OK(void)
{
	Probe_CLF = Probe_CLF_Display;
}


/*ParametersRequireValueRedoxpH_Redox Screen */
void ParametersRequireValueRedoxpH_RedoxScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_inc(void)
{
		RequireValueRedoxpH_Redox_Display +=10;
	if(RequireValueRedoxpH_Redox_Display > 990)
		RequireValueRedoxpH_Redox_Display = 990;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_dec(void)
{
		RequireValueRedoxpH_Redox_Display -=10;
	if(RequireValueRedoxpH_Redox_Display < 10)
		RequireValueRedoxpH_Redox_Display = 10;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_OK(void)
{
	RequireValueRedoxpH_Redox = RequireValueRedoxpH_Redox_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_RedoxScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueRedoxpH_pHScreen();
}



