chauphuocvu/LCD-water-control-28-11/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/GUIlib/src/uiappuser.c
/*ParametersRequireValueRedoxpH_pH Screen */
void ParametersRequireValueRedoxpH_pHScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_pHScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_pHScreen_inc(void)
{
		RequireValuepH_Display +=(float)0.1;
	if(RequireValuepH_Display > (float)7.8)
		RequireValuepH_Display = 7.8;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_pHScreen_dec(void)
{
		RequireValuepH_Display -=(float)0.1;
	if(RequireValuepH_Display < (float)6.2)
		RequireValuepH_Display = 6.2;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_pHScreen_OK(void)
{
	RequireValuepH = RequireValuepH_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueRedoxpH_pHScreen_Rodex(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueRedoxpH_RodexScreen();
}



/*ParametersRequireValueDosepH_DoseHour Screen */
void ParametersRequireValueDosepH_DoseHourScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHourScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHourScreen_inc(void)
{
		RequireValueDosepH_DoseHour_Display +=1;
	if(RequireValueDosepH_DoseHour_Display > 20)
		RequireValueDosepH_DoseHour_Display = 20;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHourScreen_dec(void)
{
		RequireValueDosepH_DoseHour_Display -=1;
	if(RequireValueDosepH_DoseHour_Display < 0)
		RequireValueDosepH_DoseHour_Display = 0;	
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHourScreen_OK(void)
{
	RequireValueDosepH_DoseHour = RequireValueDosepH_DoseHour_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHourScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueDosepH_DoseHour_pHScreen();
}



/*ParametersRequireValueDosepH_DoseHour_pH Screen */
void ParametersRequireValueDosepH_DoseHour_pHScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHour_pHScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHour_pHScreen_inc(void)
{
		RequireValuepH_Display +=(float)0.1;
	if(RequireValuepH_Display > (float)7.8)
		RequireValuepH_Display = 7.8;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHour_pHScreen_dec(void)
{
		RequireValuepH_Display -=(float)0.1;
	if(RequireValuepH_Display < (float)6.2)
		RequireValuepH_Display = 6.2;
		
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHour_pHScreen_OK(void)
{
	RequireValuepH = RequireValuepH_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseHour_pHScreen_Dose(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueDosepH_DoseHourScreen();
}



/*ParametersRequireValueDosepH_DoseDay Screen */
void ParametersRequireValueDosepH_DoseDayScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDayScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDayScreen_inc(void)
{
		RequireValueDosepH_DoseDay_Display +=1;
	if(RequireValueDosepH_DoseDay_Display > 30)
		RequireValueDosepH_DoseDay_Display = 30;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDayScreen_dec(void)
{
		RequireValueDosepH_DoseDay_Display -=1;
	if(RequireValueDosepH_DoseDay_Display < 0)
		RequireValueDosepH_DoseDay_Display = 0;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDayScreen_OK(void)
{
	RequireValueDosepH_DoseDay = RequireValueDosepH_DoseDay_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDayScreen_pH(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueDosepH_DoseDay_pHScreen();
}



/*ParametersRequireValueDosepH_DoseDay_pH Screen */
void ParametersRequireValueDosepH_DoseDay_pHScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDay_pHScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDay_pHScreen_inc(void)
{
		RequireValuepH_Display +=(float)0.1;
	if(RequireValuepH_Display > (float)7.8)
		RequireValuepH_Display = 7.8;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDay_pHScreen_dec(void)
{
		RequireValuepH_Display -=(float)0.1;
	if(RequireValuepH_Display < (float)6.2)
		RequireValuepH_Display = 6.2;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDay_pHScreen_OK(void)
{
	RequireValuepH = RequireValuepH_Display;
}
//////////////////////////////////////////////////////////////
void ParametersRequireValueDosepH_DoseDay_pHScreen_Dose(void)
{
	DestroyPage(CurrentScreen);
	Show_ParametersRequireValueDosepH_DoseDayScreen();
}


/*CalibrationWater Screen */
void CalibrationWaterScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
//////////////////////////////////////////////////////////////
void CalibrationWaterScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void CalibrationWaterScreen_inc(void)
{
	/*Chau phuoc vu 14/5/2019*/
//		CalibrationWater_Display +=1;
//	if(CalibrationWater_Display < 40)
//		CalibrationWater_Display = 40;
}
//////////////////////////////////////////////////////////////
void CalibrationWaterScreen_dec(void)
{
/*Chau phuoc vu 14/5/2019*/
//		CalibrationWater_Display -=1;
//	if(CalibrationWater_Display == 0)
//		CalibrationWater_Display = 0;
}
//////////////////////////////////////////////////////////////
void CalibrationWaterScreen_OK(void)
{
//	CalibrationWater = CalibrationWater_Display;
}


/*CalibrationAir Screen */
void CalibrationAirScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_CalibrationScreen();
}
//////////////////////////////////////////////////////////////
void CalibrationAirScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
//////////////////////////////////////////////////////////////
void CalibrationAirScreen_inc(void)
{
/*Chau phuoc vu 14/5/2019*/
//		CalibrationAir_Display +=1;
//	if(CalibrationAir_Display > 40)
//		CalibrationAir_Display = 40;	
}
//////////////////////////////////////////////////////////////
void CalibrationAirScreen_dec(void)
{	
/*Chau phuoc vu 14/5/2019*/
//		CalibrationAir_Display -=1;
//	if(CalibrationAir_Display == 0)
//		CalibrationAir_Display = 0;
}
//////////////////////////////////////////////////////////////
void CalibrationAirScreen_OK(void)
{
//	CalibrationAir = CalibrationAir_Display;
}


/*TypeOfProbeScreen */
void TypeOfProbeScreen_Back(void)
{
	DestroyPage(CurrentScreen);
	Show_SettingsScreen();
}
void TypeOfProbeScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void TypeOfProbeScreen_FreeChlorine(void)
{
	TypeofProbe = FREECHLORINE;
}
void TypeOfProbeScreen_RedoxProbe(void)
{
	TypeofProbe = REDOXPROBE;
}
void TypeOfProbeScreen_mlperhour(void)
{
	TypeofProbe = MLPERHOUR;
}
void TypeOfProbeScreen_mlperday(void)
{
	TypeofProbe = MLPERDAY;
}



/*LanguagesScreen */
void LanguagesScreen_BackToStart(void)
{
	DestroyPage(CurrentScreen);
	Show_StartScreen();
}
void LanguagesScreen_Vietnamese(void)
{
	Languages_Choose = VIETNAMESE;
}
void LanguagesScreen_English(void)
{
	Languages_Choose = ENGLISH;
}

/*chau phuoc vu*/
void WarningProbepHCalibrationScreen_YES(void)
{
	DestroyPage(CurrentScreen);
	if (status_for_warning == BACK)
	{
		Show_CalibrationScreen();
	}
	else if (status_for_warning == BACKTOSTART)
	{
		Show_StartScreen();
	}
	else ;
}

void WarningProbepHCalibrationScreen_NO(void)
{
	DestroyPage(CurrentScreen);
	Calibration_pH_Flag = CALIBRATION_PH;
	Probe_pH_Display = 4.0;
	Probe_pH_less_5 = 0;
	Probe_pH_more_5 = 0;
  pH_V_calibration_less_5_buffer = 0;
  pH_V_calibration_more_5_buffer = 0;
  Temp_calibration_less_5_buffer = 0;
  Temp_calibration_more_5_buffer = 0;
	Show_CalibrationpHProbeScreen();
}
